yonghui123/amp-vibe-analyzer/code_STM32/user/bsp/src/bsp_lcd_ra8875.c
/*
*author:MCD Application Team
*date:2026-03-04
*/

#include "bsp_lcd_ra8875.h"
#include "bsp_ra8875.h"
#include "bsp_tft_lcd.h"
#include "main.h"
#include "stm32f4xx_hal.h"

#define FLASH_DUAL_SPEED_EN			/* 双速模式， MOSI和MISO同时读取字库和图库中的数据. */

static volatile uint16_t s_usTouchX, s_usTouchY;	/* 触摸屏ADC值 */
static volatile uint8_t s_ucRA8875Busy = 0;			/* 忙标志, 其他模块通过 RA8875_IsBusy()函数判断忙 */
static volatile uint8_t s_reg_40H;		/* 0X40寄存器的值 */
static volatile uint8_t s_reg_22H;		/* 0X22寄存器的值 */
//uint8_t g_LcdDirection;	/* 显示方向.0，1，2，3 */

/* 保存当前显示窗口的位置和大小，这几个变量由 RA8875_SetDispWin() 进行设置 */
static uint16_t s_WinX = 0;
static uint16_t s_WinY = 0;
static uint16_t s_WinHeight = 272;
static uint16_t s_WinWidth = 480;

static void     RA8875_SetCursor(uint16_t _usX, uint16_t _usY);
static void RA8875_SetReadCursor(uint16_t _usX, uint16_t _usY);
static void RA8875_SetTextCursor(uint16_t _usX, uint16_t _usY);

static void BTE_SetTarBlock(uint16_t _usX, uint16_t _usY, uint16_t _usHeight, uint16_t _usWidth, uint8_t _ucLayer);
static void BTE_SetOperateCode(uint8_t _ucOperate);
static void BTE_Start(void);

/*
*********************************************************************************************************
*	函 数 名: RA8875_ReadID
*	功能说明: 读取LCD驱动芯片ID
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
uint16_t RA8875_ReadID(void)
{
	return RA8875_ReadReg(0x00);
}

/*
*********************************************************************************************************
*	函 数 名: RA8875_WriteReg
*	功能说明: 写RA8875寄存器. RA8875的寄存器地址和数据都是8bit的
*	形    参:  无
*	返 回 值: 无
*********************************************************************************************************
*/
void RA8875_WriteReg(uint8_t _ucRegAddr, uint8_t _ucRegValue)
{
	s_ucRA8875Busy = 1;				/* 设置忙标志，避免触摸中断中的程序访问冲突 */

	RA8875_WriteCmd(_ucRegAddr);
	RA8875_WriteData(_ucRegValue);

	s_ucRA8875Busy = 0;
}

/*
*********************************************************************************************************
*	函 数 名: RA8875_WriteReg
*	功能说明: 写RA8875寄存器. RA8875的寄存器地址和数据都是8bit的
*	形    参:  无
*	返 回 值: 无
*********************************************************************************************************
*/
uint8_t RA8875_ReadReg(uint8_t _ucRegAddr)
{
	RA8875_WriteCmd(_ucRegAddr);
	return RA8875_ReadData();
}

/*
*********************************************************************************************************
*	函 数 名: RA8875_InitHard
*	功能说明: 初始化RA8875。本函数不开启背光，主程序应该在初始化完毕后再调用 RA8875_SetBackLight()函数开背光
*	形    参:  无
*	返 回 值: 无
*********************************************************************************************************
*/
void RA8875_InitHard(void)
{
	uint8_t ucGPIX;
	
	/* 读取 RA8875 芯片额GPIX引脚的电平状态；1表示4.3寸屏；0表示7寸屏
	【备注】这是安富莱电子为了便于统一测试例程，在LCD模块上做的硬件标识。在做产品时，不必自动识别。
	*/
	RA8875_ReadReg(0xC7);
	g_LcdHeight = LCD_70_HEIGHT;
	g_LcdWidth = LCD_70_WIDTH;
	/* 初始化PLL.  晶振频率为25M */
	RA8875_WriteCmd(0x88);
	RA8875_Delaly1us();		/* 延迟1us */
	RA8875_WriteData(12);	/* PLLDIVM [7] = 0 ;  PLLDIVN [4:0] = 12 */

	RA8875_Delaly1ms();

	RA8875_WriteCmd(0x89);
	RA8875_Delaly1us();		/* 延迟1us */
	RA8875_WriteData(2);	/* PLLDIVK[2:0] = 2, 除以4 */

	/* RA8875 的内部系统频率 (SYS_CLK) 是结合振荡电路及PLL 电路所产生，频率计算公式如下 :
		SYS_CLK = FIN * ( PLLDIVN [4:0] +1 ) / ((PLLDIVM+1 ) * ( 2^PLLDIVK [2:0] ))
				= 25M * (12 + 1) / ((0 + 1) * (2 ^ 2))
				= 81.25MHz
	*/

	/* REG[88h]或REG[89h]被设定后，为保证PLL 输出稳定，须等待一段「锁频时间」(< 100us)。*/
	RA8875_Delaly1ms();

	/*
		配置系统控制寄存器。 中文pdf 第18页:

		bit3:2 色彩深度设定 (Color Depth Setting)
			00b : 8-bpp 的通用TFT 接口， i.e. 256 色。
			1xb : 16-bpp 的通用TFT 接口， i.e. 65K 色。	 【选这个】

		bit1:0 MCUIF 选择
			00b : 8-位MCU 接口。
			1xb : 16-位MCU 接口。 【选这个】
	*/
	RA8875_WriteReg(0x10, (1 <<3 ) | (1 << 1));	/* 配置16位MCU并口，65K色 */
	/* REG[04h] Pixel Clock Setting Register (PCSR)
		bit7  PCLK Inversion
			0 : PDAT 是在PCLK 正缘上升 (Rising Edge) 时被取样。
			1 : PDAT 是在PCLK 负缘下降 (Falling Edge) 时被取样。
		bit1:0 PCLK 频率周期设定
			Pixel Clock ,PCLK 频率周期设定。
			00b: PCLK 频率周期= 系统频率周期。
			01b: PCLK 频率周期= 2 倍的系统频率周期。
			10b: PCLK 频率周期= 4 倍的系统频率周期。
			11b: PCLK 频率周期= 8 倍的系统频率周期。
	*/
	RA8875_WriteReg(0x04, 0x81);
	RA8875_Delaly1ms();
	/* OTD9960 & OTA7001 设置 */
	RA8875_WriteReg(0x14, 0x63);
	RA8875_WriteReg(0x15, 0x00);
	RA8875_WriteReg(0x16, 0x03);
	RA8875_WriteReg(0x17, 0x03);
	RA8875_WriteReg(0x18, 0x0B);
	RA8875_WriteReg(0x19, 0xDF);
	RA8875_WriteReg(0x1A, 0x01);
	RA8875_WriteReg(0x1B, 0x1F);
	RA8875_WriteReg(0x1C, 0x00);
	RA8875_WriteReg(0x1D, 0x16);
	RA8875_WriteReg(0x1E, 0x00);
	RA8875_WriteReg(0x1F, 0x01);

	/* 设置TFT面板的 DISP  引脚为高，使能面板. 安富莱TFT模块的DISP引脚连接到RA8875芯片的GP0X脚 */
	RA8875_WriteReg(0xC7, 0x01);	/* DISP = 1 */

	/* LCD 显示/关闭讯号 (LCD Display on) */
	RA8875_WriteReg(0x01, 0x80);

	/* 	REG[40h] Memory Write Control Register 0 (MWCR0)

		Bit 7	显示模式设定
			0 : 绘图模式。
			1 : 文字模式。

		Bit 6	文字写入光标/内存写入光标设定
			0 : 设定文字/内存写入光标为不显示。
			1 : 设定文字/内存写入光标为显示。

		Bit 5	文字写入光标/内存写入光标闪烁设定
			0 : 游标不闪烁。
			1 : 游标闪烁。

		Bit 4   NA

		Bit 3-2  绘图模式时的内存写入方向
			00b : 左 -> 右，然后上 -> 下。
			01b : 右 -> 左，然后上 -> 下。
			10b : 上 -> 下，然后左 -> 右。
			11b : 下 -> 上，然后左 -> 右。

		Bit 1 	内存写入光标自动增加功能设定
			0 : 当内存写入时光标位置自动加一。
			1 : 当内存写入时光标位置不会自动加一。

		Bit 0 内存读取光标自动增加功能设定
			0 : 当内存读取时光标位置自动加一。
			1 : 当内存读取时光标位置不会自动加一。
	*/
	//RA8875_WriteReg(0x40, 0x00);	/* 选择绘图模式 */	
	RA8875_SetDirection(0);

	/* 	REG[41h] Memory Write Control Register1 (MWCR1)
		写入目的位置，选择图层1
	*/
	RA8875_WriteReg(0x41, 0x00);	/* 选择绘图模式, 目的为CGRAM */

	RA8875_SetDispWin(0, 0, g_LcdHeight, g_LcdWidth);
}

/*
*********************************************************************************************************
*	函 数 名: RA8875_SetDirection
*	功能说明: 设置显示方向。
*	形    参:  _ucDir : 显示方向代码 0 横屏正常, 1=横屏180度翻转, 2=竖屏, 3=竖屏180度翻转
*	返 回 值: 无
*********************************************************************************************************
*/
void RA8875_SetDirection(uint8_t _ucDir)
{
	uint8_t reg20H;
	
	s_reg_40H = 0x01;
	g_LcdDirection = _ucDir;
	if (_ucDir == 0)
	{
		s_reg_40H = 0x01;
		reg20H = (0 << 3) | (0 << 2);
	}
	else if (_ucDir == 1)
	{
		s_reg_40H = 0x05;
		reg20H = (1 << 3) | (1 << 2);
	}
	else if (_ucDir == 2)
	{
		s_reg_40H = 0x09;
		reg20H = (0 << 3) | (1 << 2);
	}
	else if (_ucDir == 3)
	{
		s_reg_40H = 0x09;
		reg20H = (1 << 3) | (0 << 2);
	}
	RA8875_WriteReg(0x40, s_reg_40H);	

