yonghui123/amp-vibe-analyzer/code_STM32/user/bsp/src/bsp_lcd_ra8875.c
	/*
		Serial Flash/ROM 频率频率设定
			0xb: SFCL 频率 = 系统频率频率(当DMA 为使能状态，并且色彩深度为256 色，则SFCL 频率
				固定为=系统频率频率/ 2)
			10b: SFCL 频率 =系统频率频率/ 2
			11b: SFCL 频率 =系统频率频率/ 4

		安富莱TFT驱动板。4.3寸系统频率为 68MHz； 7寸系统频率为 81.25MHz。

		8M串行Flash的访问速度:SPI 时钟频率:80MHz(max.)
		因此可以设置为 1 分频
	*/
	RA8875_WriteReg(0x06, (0 << 0));	/* 设置SCL时钟频率 */

	/* 设定源地址
		B0H   DMA 来源开始位置[7:0]
		B1H   DMA 来源开始位置[15:8]
		B2H   DMA 来源开始位置[23:16]
	*/
	RA8875_WriteReg(0xB0, (uint8_t)_uiFlashAddr);
	RA8875_WriteReg(0xB1, (uint8_t)(_uiFlashAddr >> 8));
	RA8875_WriteReg(0xB2, (uint8_t)(_uiFlashAddr >> 16));

	/*
		设置区块大小
		B4   DMA 区块宽度[7:0]
		B5   DMA 区块宽度[9:8]
		B6   DMA 区块高度[7:0]
	    B7   DMA 区块高度[9:8]
	    B8   DMA 来源图片宽度[7:0]
	    B9   DMA 来源图片宽度[9:8]
	*/
	RA8875_WriteReg(0xB4, _usWidth);		/* DMA 区块宽度 */
	RA8875_WriteReg(0xB5, _usWidth >> 8);

	RA8875_WriteReg(0xB6, _usHeight);		/* DMA 区块高度 */
	RA8875_WriteReg(0xB7, _usHeight >> 8);

	RA8875_WriteReg(0xB8, _usWidth);		/* DMA 来源图片宽度 */
	RA8875_WriteReg(0xB9, _usWidth >> 8);

	RA8875_WriteReg(0xBF, 1 << 1);			/* 选择区块模式 */
	RA8875_WriteReg(0xBF, 1 << 1);			/* 选择区块模式 */

	s_ucRA8875Busy = 1;
	RA8875_WriteReg(0xBF, (1 << 1) | (1 << 0));			/* 启动DMA传输 */
	while (RA8875_ReadReg(0xBF) & (1 << 0));	/* 等待结束 */
	RA8875_WaitBusy();
	s_ucRA8875Busy = 0;

	RA8875_QuitWinMode();					/* 退出小窗口绘图模式 */
}

/*
*********************************************************************************************************
*	函 数 名: RA8875_DrawBMP
*	功能说明: 在LCD上显示一个BMP位图，位图点阵扫描次序:从左到右，从上到下
*	形    参:
*			_usX, _usY : 图片的坐标
*			_usHeight  :图片高度
*			_usWidth   :图片宽度
*			_ptr       :图片点阵指针
*	返 回 值: 无
*********************************************************************************************************
*/
void RA8875_DrawBMP(uint16_t _usX, uint16_t _usY, uint16_t _usHeight, uint16_t _usWidth, uint16_t *_ptr)
{
	uint32_t index = 0;
	const uint16_t *p;

	/* 设置图片的位置和大小， 即设置显示窗口 */
	RA8875_SetDispWin(_usX, _usY, _usHeight, _usWidth);

	s_ucRA8875Busy = 1;

	RA8875_WriteCmd(0x02); 		/* 准备读写显存 */

	p = _ptr;
	for (index = 0; index < _usHeight * _usWidth; index++)
	{
		/*
			armfly : 进行优化, 函数就地展开
			RA8875_WriteRAM(_ptr[index]);

			此处可考虑用DMA操作
		*/
		RA8875_WriteData16(*p++);
	}
	s_ucRA8875Busy = 0;

	/* 退出窗口绘图模式 */
	RA8875_QuitWinMode();
}

/*
*********************************************************************************************************
*	函 数 名: RA8875_StartDirectDraw
*	功能说明: 开始直接绘图模式.  不支持SPI模式，仅支持8080模式
*	形    参:
*			_usX, _usY : 显示窗口的坐标
*			_usHeight  : 显示窗口的高度
*			_usWidth   : 显示窗口的宽度
*	返 回 值: 无
*********************************************************************************************************
*/
void RA8875_StartDirectDraw(uint16_t _usX, uint16_t _usY, uint16_t _usHeight, uint16_t _usWidth)
{
	/* 设置图片的位置和大小， 即设置显示窗口 */
	RA8875_SetDispWin(_usX, _usY, _usHeight, _usWidth);

	s_ucRA8875Busy = 1;

	RA8875_WriteCmd(0x02); 		/* 准备读写显存 */

	/* 之后，应用程序可以直接绘图 */
}

/*
*********************************************************************************************************
*	函 数 名: RA8875_QuitDirectDraw
*	功能说明: 退出绘图模式.  不支持SPI模式，仅支持8080模式
*	形    参:
*			_usX, _usY : 显示窗口的坐标
*			_usHeight  : 显示窗口的高度
*			_usWidth   : 显示窗口的宽度
*	返 回 值: 无
*********************************************************************************************************
*/
void RA8875_QuitDirectDraw(void)
{
	s_ucRA8875Busy = 0;

	/* 退出窗口绘图模式 */
	RA8875_QuitWinMode();
}

/*
*********************************************************************************************************
*	函 数 名: RA8875_DrawLine
*	功能说明: 采用RA8875的硬件功能，在2点间画一条直线。
*	形    参:
*			_usX1, _usY1 :起始点坐标
*			_usX2, _usY2 :终止点Y坐标
*			_usColor     :颜色
*	返 回 值: 无
*********************************************************************************************************
*/
void RA8875_DrawLine(uint16_t _usX1 , uint16_t _usY1 , uint16_t _usX2 , uint16_t _usY2 , uint16_t _usColor)
{
	/* pdf 第131页
		RA8875 支持直线绘图功能，让使用者以简易或低速的MCU 就可以在TFT 模块上画直线。先设
		定直线的起始点REG[91h~94h] 与结束点REG[95h~98h]，直线的颜色REG[63h~65h]，然后启
		动绘图设定REG[90h] Bit4 = 0, Bit0=0 且REG[90h] Bit7 = 1，RA8875 就会将直线的图形写入
		DDRAM，相对的在TFT 模块上就可以显示所画的直线。
	*/

	if ((_usX1 == _usX2) && (_usY1 == _usY2))
	{
		RA8875_PutPixel(_usX1, _usY1, _usColor);
		return;
	}

	if (g_LcdDirection > 1)	/* 竖屏  */
	{
		uint16_t temp;
		
		temp = _usX1;
		_usX1 = _usY1;
		_usY1 = temp;

		temp = _usX2;
		_usX2 = _usY2;
		_usY2 = temp;		
	}
	
	/* 设置起点坐标 */
	RA8875_WriteReg(0x91, _usX1);
	RA8875_WriteReg(0x92, _usX1 >> 8);
	RA8875_WriteReg(0x93, _usY1);
	RA8875_WriteReg(0x94, _usY1 >> 8);

	/* 设置终点坐标 */
	RA8875_WriteReg(0x95, _usX2);
	RA8875_WriteReg(0x96, _usX2 >> 8);
	RA8875_WriteReg(0x97, _usY2);
	RA8875_WriteReg(0x98, _usY2 >> 8);

	RA8875_SetFrontColor(_usColor);	/* 设置直线的颜色 */

	s_ucRA8875Busy = 1;
//	RA8875_WriteReg(0x90, (1 << 7) | (0 << 4) | (0 << 0));/* 开始画直线 */
	RA8875_WriteCmd(0x90);
	RA8875_WriteData((1 << 7) | (0 << 4) | (0 << 0));
//	while (RA8875_ReadReg(0x90) & (1 << 7));				/* 等待结束 */
	RA8875_WaitBusy();
	s_ucRA8875Busy = 0;
}

/*
*********************************************************************************************************
*	函 数 名: RA8875_DrawRect
*	功能说明: 采用RA8875硬件功能绘制矩形
*	形    参:
*			_usX,_usY:矩形左上角的坐标
*			_usHeight :矩形的高度
*			_usWidth  :矩形的宽度
*			_usColor  :颜色
*	返 回 值: 无
*********************************************************************************************************
*/
void RA8875_DrawRect(uint16_t _usX, uint16_t _usY, uint16_t _usHeight, uint16_t _usWidth, uint16_t _usColor)
{
	/*
		RA8875 支持方形绘图功能，让使用者以简易或低速的MCU 就可以在TFT 模块上画方形。先设
	定方形的起始点REG[91h~94h]与结束点REG[95h~98h]，方形的颜色REG[63h~65h]，然后启
	动绘图设定REG[90h] Bit4=1, Bit0=0 且REG[90h] Bit7 = 1，RA8875 就会将方形的图形写入
	DDRAM，相对的在TFT 模块上就可以显示所画的方形。若设定REG[90h] Bit5 = 1，则可画出一
	实心方形 (Fill)

	 ---------------->---
	|(_usX，_usY)        |
	V                    V  _usHeight
	|                    |
	 ---------------->---
		  _usWidth
	*/

	if (g_LcdDirection > 1)	/* 竖屏  */
	{
		uint16_t temp;
		
		temp = _usX;
		_usX = _usY;
		_usY = temp;

		temp = _usHeight;
		_usHeight = _usWidth;
		_usWidth = temp;		
	}

	/* 设置起点坐标 */
	RA8875_WriteReg(0x91, _usX);
	RA8875_WriteReg(0x92, _usX >> 8);
	RA8875_WriteReg(0x93, _usY);
	RA8875_WriteReg(0x94, _usY >> 8);

	/* 设置终点坐标 */
	RA8875_WriteReg(0x95, _usX + _usWidth - 1);
	RA8875_WriteReg(0x96, (_usX + _usWidth - 1) >> 8);
	RA8875_WriteReg(0x97, _usY + _usHeight - 1);
	RA8875_WriteReg(0x98, (_usY + _usHeight - 1) >> 8);

