yonghui123/amp-vibe-analyzer/code_STM32/user/bsp/src/bsp_lcd_ra8875.c
/*
*********************************************************************************************************
*	函 数 名: RA8875_SetCursor
*	功能说明: 设置写显存的光标位置（图形模式）
*	形    参:  _usX : X坐标; _usY: Y坐标
*	返 回 值: 无
*********************************************************************************************************
*/
static void RA8875_SetCursor(uint16_t _usX, uint16_t _usY)
{
	if (g_LcdDirection > 1)	/* 竖屏  */
	{
		RA8875_WriteReg(0x46, _usY);
		RA8875_WriteReg(0x47, _usY >> 8);
		RA8875_WriteReg(0x48, _usX);
		RA8875_WriteReg(0x49, _usX >> 8);
	}
	else	/* 横屏 */
	{
		RA8875_WriteReg(0x46, _usX);
		RA8875_WriteReg(0x47, _usX >> 8);
		RA8875_WriteReg(0x48, _usY);
		RA8875_WriteReg(0x49, _usY >> 8);
	}
}

/*
*********************************************************************************************************
*	函 数 名: RA8875_SetReadCursor
*	功能说明: 设置读显存的光标位置。 很多其他的控制器写光标和读光标是相同的寄存器，但是RA8875是不同的。
*	形    参:  _usX : X坐标; _usY: Y坐标
*	返 回 值: 无
*********************************************************************************************************
*/
static void RA8875_SetReadCursor(uint16_t _usX, uint16_t _usY)
{
	if (g_LcdDirection > 1)	/* 竖屏  */
	{
		uint16_t temp;
		
		temp = _usX;
		_usX = _usY;
		_usY = temp;
	}
		
	/* 设置内存读光标的坐标 */
	RA8875_WriteReg(0x4A, _usX);
	RA8875_WriteReg(0x4B, _usX >> 8);
	RA8875_WriteReg(0x4C, _usY);
	RA8875_WriteReg(0x4D, _usY >> 8);
}

/*
*********************************************************************************************************
*	函 数 名: RA8875_SetTextCursor
*	功能说明: 设置文本写入光标位置
*	形    参:  _usX : X坐标; _usY: Y坐标
*	返 回 值: 无
*********************************************************************************************************
*/
static void RA8875_SetTextCursor(uint16_t _usX, uint16_t _usY)
{
	if (g_LcdDirection > 1)	/* 竖屏  */
	{
		uint16_t temp;
		
		temp = _usX;
		_usX = _usY;
		_usY = temp;
	}
			
	/* 设置内存读光标的坐标 */
	RA8875_WriteReg(0x2A, _usX);
	RA8875_WriteReg(0x2B, _usX >> 8);
	RA8875_WriteReg(0x2C, _usY);
	RA8875_WriteReg(0x2D, _usY >> 8);
}

/*
*********************************************************************************************************
*	函 数 名: RA8875_QuitWinMode
*	功能说明: 退出窗口显示模式，变为全屏显示模式
*	形    参:  无
*	返 回 值: 无
*********************************************************************************************************
*/
void RA8875_QuitWinMode(void)
{
	RA8875_SetDispWin(0, 0, g_LcdHeight, g_LcdWidth);
}


/*
*********************************************************************************************************
*	函 数 名: RA8875_CtrlGPO
*	功能说明: 控制GPO输出状态，也就是KOUT0-KOUT3的状态
*	形    参: _pin : 0-3, 分别对应 GPO0 GPO1 GPO2 GPO3
*			  _value : 0 或 1
*	返 回 值: 无
*********************************************************************************************************
*/
void RA8875_CtrlGPO(uint8_t _pin, uint8_t _value)
{
	RA8875_WriteReg(0x13, _value << _pin);
}

/*
*********************************************************************************************************
*	函 数 名: RA8875_SetBackLight
*	功能说明: 配置RA8875芯片的PWM1相关寄存器，控制LCD背光
*	形    参:  _bright 亮度，0是灭，255是最亮
*	返 回 值: 无
*********************************************************************************************************
*/
void RA8875_SetBackLight(uint8_t _bright)
{
	if (_bright == 0)
	{
		/* 关闭PWM, PWM1引脚缺省输出LOW  */
		RA8875_WriteReg(0x8A, 0 << 6);
	}
	else if (_bright == BRIGHT_MAX)	/* 最大亮度 */
	{
		/* 关闭PWM, PWM1引脚缺省输出HIGH */
		RA8875_WriteReg(0x8A, 1 << 6);
	}
	else
	{
		/* 使能PWM1, 进行占空比调节 */

		/* 	REG[8Ah] PWM1 Control Register (P1CR)

			Bit7 脉波宽度调变 (PWM1) 设定
				0 : 关闭，此状态下，PWM1 输出准位依照此缓存器Bit6 决定。
				1 : 开启。

			Bit6 PWM1 关闭时的准位
				0 : 当PWM 关闭或于睡眠模式时，PWM1 输出为”Low” 状态。
				1 : 当PWM 关闭或于睡眠模式时，PWM1 输出为”High” 状态。

			Bit5 保留

			Bit4 PWM1 功能选择
				0 : PWM1 功能。
				1 : PWM1 固定输出一频率为外部晶体振荡器Clock (Fin) 频率 1 /16 的Clock

			Bit3-0  PWM1 电路的频率来源选择PWM_CLK	【不是PWM输出频率】
				0000b : SYS_CLK / 1   , 1000b : SYS_CLK / 256
				0001b : SYS_CLK / 2   , 1001b : SYS_CLK / 512
				0010b : SYS_CLK / 4   , 1010b : SYS_CLK / 1024
				0011b : SYS_CLK / 8   , 1011b : SYS_CLK / 2048
				0100b : SYS_CLK / 16  , 1100b : SYS_CLK / 4096
				0101b : SYS_CLK / 32  , 1101b : SYS_CLK / 8192
				0110b : SYS_CLK / 64  , 1110b : SYS_CLK / 16384
				0111b : SYS_CLK / 128 , 1111b : SYS_CLK / 32768

				“SYS_CLK” 代表系统频率， 例如SYS_CLK 为20MHz， 当Bit[3:0] =0001b 时，PWM1 频率来源为10MHz。
				实际输出的PWM频率还需要除以 256，支持8位的分辨率。

				安富莱的4.3寸(480*272)模块，SYS_CLK =  68.75MHz
				安富莱的7.0寸(800*480)模块，SYS_CLK =  81.25MHz

				为了避免音频噪声，PWM频率可以选择
				（1） 低频100Hz
				（2） 高于 20KHz

				比如，Bit3-0为0011b时 SYS_CLK / 8，
					4.3寸 输出的PWM频率为 (68.75MHz / 8) / 256 = 33.56KHz
					7寸 输出的PWM频率为 (75 MHz / 8) / 256 = 36.62KHz
		*/

		// 5寸和7寸新屏可以用 3 ，高频PWM, 4.3寸不行
		RA8875_WriteReg(0x8A, (1 << 7) | 3);   
		// RA8875_WriteReg(0x8A, (1 << 7) | 12);

		/* REG[8Bh] PWM1 Duty Cycle Register (P1DCR) */
		RA8875_WriteReg(0x8B, _bright);
	}
}
